#### Terraform Cloud Workspace 📂`cloudflare`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
cloudflare relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infra/infra/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infra/infra

To view this run in a browser, visit:
https://app.terraform.io/app/jakuboskera/cloudflare/runs/run-bL2kUEu1i1EKRdcr

Waiting for the plan to start...

Terraform v1.0.8
on linux_amd64
Initializing plugins and modules...
cloudflare_zone.jakuboskera_dev: Refreshing state... [id=efffdee59d36e33a2b771acb7974061f]
cloudflare_record.jakuboskera_dev_111: Refreshing state... [id=ca21b4eb80e0c1d03e6e1c6ea9d407f5]
cloudflare_record.jakuboskera_dev_109: Refreshing state... [id=36abf8eedc88aa38262e130dc89326f4]
cloudflare_record.jakuboskera_dev_mx01: Refreshing state... [id=bce2e48bacb0d0d9b9cf8c14141a0a3c]
cloudflare_record.jakuboskera_dev_110: Refreshing state... [id=08802f83deded05b69bf2aeec36daaf7]
cloudflare_record.jakuboskera_dev_dmarc: Refreshing state... [id=4822b55dd9c2a1d76dcbfa7603c6767f]
cloudflare_record.www_jakuboskera_dev: Refreshing state... [id=71a785c52b5a617611205a9071350376]
cloudflare_record.jakuboskera_dev_spf1: Refreshing state... [id=ce7d6a1caec3efbc8b6f34d294db5251]
cloudflare_record.jakuboskera_dev_personal: Refreshing state... [id=5880b8022bc054a2c481f462da002288]
cloudflare_record.jakuboskera_dev_108: Refreshing state... [id=de032e29c2f42c84809dc66a424797a5]
cloudflare_record.jakuboskera_dev_mx02: Refreshing state... [id=2aad6874ca3ce24182e8b84d13b97b93]
cloudflare_record.jakuboskera_dev_sig1: Refreshing state... [id=173d4225b8649aadfd142f2a86ff14f0]
cloudflare_zone_settings_override.jakuboskera_dev: Refreshing state... [id=efffdee59d36e33a2b771acb7974061f]
cloudflare_record.jakuboskera_dev_domainconnect: Refreshing state... [id=705ec4ebae10382d15e1b3859d88f8d0]
cloudflare_record.guestbook_jakuboskera_dev: Refreshing state... [id=878849bcbe518de85ed5afe4a8b58d2e]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # cloudflare_zone_settings_override.jakuboskera_dev has been changed
  ~ resource "cloudflare_zone_settings_override" "jakuboskera_dev" {
        id                       = "efffdee59d36e33a2b771acb7974061f"
      ~ readonly_settings        = [
            # (2 unchanged elements hidden)
            "http2",
          + "long_lived_grpc",
            "mirage",
            # (7 unchanged elements hidden)
            "webp",
          - "binary_ast",
            "image_resizing",
        ]
        # (5 unchanged attributes hidden)

      ~ settings {
          ~ always_online               = "on" -> "off"
            # (40 unchanged attributes hidden)

          ~ minify {
              ~ css  = "off" -> "on"
              ~ js   = "off" -> "on"
                # (1 unchanged attribute hidden)
            }


            # (2 unchanged blocks hidden)
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.todo_jakuboskera_dev will be created
  + resource "cloudflare_record" "todo_jakuboskera_dev" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "todo"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "concave-kurrat-osshq1ve92b2g44eyhuizmyr.herokudns.com"
      + zone_id         = "efffdee59d36e33a2b771acb7974061f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @jakuboskera, Action: `pull_request`*